# Faster R-CNN with Inception-Resnet v2, configured for the entire dataset that is available (MUSCIMA++, Edirom, Weber)

model {
  faster_rcnn {
    num_classes: 3
    image_resizer {
      keep_aspect_ratio_resizer {
        min_dimension: 600
        max_dimension: 1024
      }
    }
    feature_extractor {
      type: 'faster_rcnn_inception_resnet_v2'
      first_stage_features_stride: 8
    }
    first_stage_anchor_generator {
      grid_anchor_generator {
        scales: [0.25, 0.5, 1.0, 2.0, 4.0]
        aspect_ratios: [0.5, 1.0, 2.0, 4.0]
        height_stride: 8
        width_stride: 8
      }
    }
    first_stage_box_predictor_conv_hyperparams {
      op: CONV
      regularizer {
        l2_regularizer {
          weight: 0.0
        }
      }
      initializer {
        truncated_normal_initializer {
          stddev: 0.01
        }
      }
    }
    first_stage_nms_score_threshold: 0.0
    first_stage_nms_iou_threshold: 0.6
    first_stage_max_proposals: 600
    first_stage_localization_loss_weight: 4.0
    first_stage_objectness_loss_weight: 1.0
    initial_crop_size: 14
    maxpool_kernel_size: 2
    maxpool_stride: 2
    second_stage_box_predictor {
      mask_rcnn_box_predictor {
        use_dropout: false
        dropout_keep_probability: 1.0
        fc_hyperparams {
          op: FC
          regularizer {
            l2_regularizer {
              weight: 0.0
            }
          }
          initializer {
            variance_scaling_initializer {
              factor: 1.0
              uniform: true
              mode: FAN_AVG
            }
          }
        }
      }
    }
    second_stage_post_processing {
      batch_non_max_suppression {
        score_threshold: 0.0
        iou_threshold: 0.6
        max_detections_per_class: 600
        max_total_detections: 600
      }
      score_converter: SOFTMAX
    }
    second_stage_localization_loss_weight: 4.0
    second_stage_classification_loss_weight: 1.0
  }
}

train_config: {
  batch_size: 1
  optimizer {
    rms_prop_optimizer: {
      learning_rate: {
        exponential_decay_learning_rate {
          initial_learning_rate: 0.003
          decay_steps: 80000
          decay_factor: 0.95
        }
      }
      momentum_optimizer_value: 0.9
      decay: 0.9
      epsilon: 1.0
    }
  }
  gradient_clipping_by_norm: 10.0
  fine_tune_checkpoint: "MeasureDetector/data/faster_rcnn_inception_resnet_v2_atrous_coco_2018_01_28/model.ckpt"
  from_detection_checkpoint: true
  load_all_detection_checkpoint_vars: true

  num_steps: 30000 
  
  data_augmentation_options {
    random_horizontal_flip {
    }
	
	random_image_scale {
		min_scale_ratio: 0.8
		max_scale_ratio: 1.2
    }
	
	random_adjust_brightness {
	}
	
	random_adjust_contrast {
	}
  }
}


train_input_reader: {
  tf_record_input_reader {
    input_path: "MeasureDetector/data/training.record-?????-of-00004"
  }
  label_map_path: "MeasureDetector/mapping.txt"
}

eval_config: {
  metrics_set: "coco_detection_metrics"
  use_moving_averages: false
  num_examples: 800
  # Note: The below line limits the evaluation process to 1 evaluation.
  # Remove the below line to evaluate indefinitely.
  max_evals: 1
}

eval_input_reader: {
  tf_record_input_reader {
    input_path: "MeasureDetector/data/validation.record-?????-of-00004"
    # input_path: "MeasureDetector/data/test.record-?????-of-00004"
  }
  label_map_path: "MeasureDetector/mapping.txt"
  shuffle: false
  num_readers: 1
}
